v2106/phaseChangeColumn/cavitation/1x640/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.05)
    (0.1 0 -0.05)
    (0.1 2 -0.05)
    (0 2 -0.05)
    (0 0 0.05)
    (0.1 0 0.05)
    (0.1 2 0.05)
    (0 2 0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 640 1) simpleGrading (1 1 1)
);

boundary
(
    verticalWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }

    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
